DataProcessors/ЗакрытыеНоНеоплаченныеЗаказНаряды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытыеНоНеоплаченныеЗаказНаряды</Name>
			<Comment>Закрытые но неоплаченные заказ-наряды</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтчетыПоДЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыКомпании</Name>
			<Comment>Блок учета взаиморасчетов с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма долга в валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, с которым мы ведем взаиморасчеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Документ отгрузки/поставки/оплаты по которому образовался долг</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/РассылкаПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РассылкаПочты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРассылок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиРассылки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВремяНаПеремещениеМеждуДЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВремяНаПеремещениеМеждуДЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность (в минутах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентрУход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентрПриход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРемонта</Name>
			<Comment>Типы ремонта (платный/бесплатный)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Платный</Name>
					<Comment>Ремонт платный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бесплатный</Name>
					<Comment>Ремонт бесплатный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсточникиРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИсточникиРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жалоба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УРВОпоздавшие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныеРемонты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладскиеОтчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладАвтомобилей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредстоящиеОплатыПокупателей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неоплаченные</Name>
					<Comment>Неоплаченные</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Незакрытые</Name>
					<Comment>Незакрытые</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРассылок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлиенскаяСлужба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Руководители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПоУРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеОтчетыПоУРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучателиСкладскихОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтарыеЗапасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптовыеПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеоплаченныеЗН</Name>
					<Comment>Неоплаченные заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНеоплаченныеЗН</Name>
					<Comment>Все неоплаченные заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезакрытыеЗН</Name>
					<Comment>Незакрытые заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНезакрытыеЗН</Name>
					<Comment>Все незакрытые заказ-наряды</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КодГруппыАдресаЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КодГруппыАдресаЭлектронногоПисьма</Name>
			<Comment>Перечисление кодов группы адреса электронного письма</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
					<Comment>Кому</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копии</Name>
					<Comment>Копия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
					<Comment>Скрытая копия</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФорматТекста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФорматТекста</Name>
			<Comment>Тип текста HTML или Простой текст</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
					<Comment>Формат текста HTML </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
					<Comment>Текстовый формат </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЗакрытыеНоНеоплаченныеЗаказНаряды/Ext/ObjectModule.bsl
Процедура СформироватьОтчет() Экспорт

	ПустаяДата = Дата(1, 1, 1);
	Дата = НачалоДня(Дата);
	ОтчетыПоДЦ.Очистить();
	
	// Запрос для списка нарушителей
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаОборот) КАК Долг,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.СуммаДокумента КАК СуммаДокумента,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка КАК Сделка,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ДатаЗакрытия КАК ДатаЗакрытияЗН,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.Контрагент КАК КонтрагентЗН,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ПодразделениеКомпании.Родитель КАК ДилерскийЦентр,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ПодразделениеКомпании.Родитель.Наименование КАК ДилерскийЦентр_Наименование,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ВидРемонта.ГарантияЗавода КАК ГарантияЗавода,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.Контрагент.Наименование КАК Контрагент_Наименование
	                      |ИЗ
	                      |	РегистрНакопления.ВзаиморасчетыКомпании.Обороты(, , , ) КАК ВзаиморасчетыКомпанииОстаткиИОбороты
	                      |ГДЕ
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаОборот > 0
	                      |	И ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка ССЫЛКА Документ.ЗаказНаряд
	                      |	И ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ВидРемонта.ТипРемонта = ЗНАЧЕНИЕ(Перечисление.ТипыРемонта.Платный)
	                      |	И ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |	И НЕ ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.Контрагент.НашаФирма
	                      |	И НЕ ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ВидРемонта.ГарантияЗавода
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ДатаЗакрытия,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.СуммаДокумента,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.Контрагент,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ПодразделениеКомпании.Родитель,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ПодразделениеКомпании.Родитель.Наименование,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.ВидРемонта.ГарантияЗавода,
	                      |	ВзаиморасчетыКомпанииОстаткиИОбороты.Сделка.Контрагент.Наименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДилерскийЦентр_Наименование,
	                      |	Контрагент_Наименование");
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата)-25200);  
	
	//3600 * 7, то есть до 17 часов предыдущего дня
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата)); 
  			
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДЦ = Результат.Скопировать();
	
	//ТаблицаДЦ.ВыбратьСтроку(ТаблицаДЦ.Количество());
  	
	ТаблицаДЦ.Свернуть("ДилерскийЦентр");
	
	//ТаблицаДЦ.ВыбратьСтроку(ТаблицаДЦ.Количество());
	
  	//=========================================================
	
	Для Каждого СтрокаДЦ Из ТаблицаДЦ Цикл 
		
  		ТабДокумент = Новый ТабличныйДокумент();
		Макет = ПолучитьМакет("Отчёт");
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Дата = Формат(Дата, "ДЛФ=ДД");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДЦ");
		ОбластьМакета.Параметры.ДилерскийЦентр = Строка(СтрокаДЦ.ДилерскийЦентр);
		ТабДокумент.Вывести(ОбластьМакета);

		МассивСтрок = Результат.НайтиСтроки(Новый Структура("ДилерскийЦентр", СтрокаДЦ.ДилерскийЦентр));				
		сч = 0;
  		
  		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			
  			ОбластьМакета = Макет.ПолучитьОбласть("Строка"); 
 			
			сч = сч + 1;
			
			ОбластьМакета.Параметры.Ном = Строка(сч);
			ОбластьМакета.Параметры.Долг = СтрокаТаблицы.Долг;  
			ОбластьМакета.Параметры.СуммаДокумента = СтрокаТаблицы.СуммаДокумента;  
			ОбластьМакета.Параметры.Сделка = СтрокаТаблицы.Сделка;  
		    ОбластьМакета.Параметры.КонтрагентЗН = СтрокаТаблицы.КонтрагентЗН;
 			
 			ТабДокумент.Вывести(ОбластьМакета);
 			 
		КонецЦикла;
		
		#Если Клиент Тогда
			Если сч > 0 Тогда
				ТабДокумент.ТолькоПросмотр=Истина;
				ТабДокумент.Показать();
			КонецЕсли;	
		#КонецЕсли
   		
		Если сч > 0 Тогда
			// сохранить в файл Excel и вернуть полное имя
			ИмяФайла = ПолучитьИмяВременногоФайла("xlsx"); // c:\Users\semenikhin_i\AppData\Local\Temp\v8_E508_74.xlsx
			Попытка
				ТабДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			Исключение
				ЗаписьЖурналаРегистрации("Обработка.ЗакрытыеНоНеоплаченныеЗН", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при сохранении файла-отчета: " + ОписаниеОшибки()); 
				Продолжить;
			КонецПопытки;
		Иначе
			ИмяФайла = "";
		КонецЕсли;
		
		НовыйОтчет = ОтчетыПоДЦ.Добавить();
		НовыйОтчет.ДЦ = СтрокаДЦ.ДилерскийЦентр;
		НовыйОтчет.ИмяФайла = ИмяФайла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассылкаОтчетаПоНеоплаченнымЗН(Параметры = Неопределено) Экспорт
	ТекущаяДата = ТекущаяДата();
	Если Параметры <> Неопределено И ТипЗнч(Параметры[0]) = Тип("ПеречислениеСсылка.ИсточникиРассылки") Тогда
		ИсточникРассылки = Параметры[0];
	Иначе
		ИсточникРассылки = Перечисления.ИсточникиРассылки.Неоплаченные;
	КонецЕсли;
	
	НаборДляРассылки = РегистрыСведений.РассылкаПочты.СоздатьНаборЗаписей();
	НаборДляРассылки.Отбор.ТипРассылки.Установить(Перечисления.ТипыРассылок.НеоплаченныеЗН);
	НаборДляРассылки.Отбор.ИсточникРассылки.Установить(Перечисления.ИсточникиРассылки.Неоплаченные);
	НаборДляРассылки.Прочитать();
	
 	НаборДляВсехДЦ = РегистрыСведений.РассылкаПочты.СоздатьНаборЗаписей();
	НаборДляВсехДЦ.Отбор.ТипРассылки.Установить(Перечисления.ТипыРассылок.ВсеНеоплаченныеЗН);
	НаборДляВсехДЦ.Отбор.ИсточникРассылки.Установить(Перечисления.ИсточникиРассылки.Неоплаченные);
	НаборДляВсехДЦ.Прочитать();
	
	Если НаборДляРассылки.Количество() + НаборДляВсехДЦ.Количество() = 0 Тогда 
 		ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
		        УровеньЖурналаРегистрации.Предупреждение, , ,
		        "Список адресатов рассылки пуст!"); 
 		Возврат;
	КонецЕсли;
	
	//обрФормироватьОтчет = Обработки.ФормированиеОтчетаУРВ.Создать();
	//обрФормироватьОтчет.Дата = ТекущаяДата;
	//обрФормироватьОтчет.СформироватьОтчет();
	
	// цикл по ТЧ ОтчетыПоДЦ
	
	Для Каждого СтрокаОтчет Из ОтчетыПоДЦ Цикл
 		ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();	 
 		Для Каждого Рассылка из НаборДляВсехДЦ Цикл
			АдресЭлПочты = киПолучитьПредставлениеКИ(Рассылка.Сотрудники, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
			Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
 				СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
				СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
				СтрокаПолучатели.Представление = АдресЭлПочты;
				СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
		        ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Рассылка из НаборДляРассылки Цикл
			// проверка на принадлежность текущему ДЦ
			//Бондаренко++ 20240607
			//Подразделение = Рассылка.Сотрудники.Подразделение;
			Подразделение = Рассылка.Подразделение; 
 			//Если ЗначениеЗаполнено(Рассылка.Подразделение) Тогда
			//	ДЦРассылка = Рассылка.Подразделение.ДилерскийЦентр;
			//Иначе
			//	ДЦРассылка = Справочники.ДилерскиеЦентры.ПустаяСсылка();
			//КонецЕсли;
 			//Если СтрокаОтчет.ДЦ.ДилерскийЦентр = Подразделение.ДилерскийЦентр Или СтрокаОтчет.ДЦ = ДЦРассылка Тогда
			Если СтрокаОтчет.ДЦ = Подразделение Тогда
			//Бондаренко-- 20240607
				АдресЭлПочты = киПолучитьПредставлениеКИ(Рассылка.Сотрудники, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
				Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
					СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
					СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
					СтрокаПолучатели.Представление = АдресЭлПочты;
					СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
			        ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
				КонецЕсли;                                      
 			КонецЕсли;
		КонецЦикла;
		
		Если ЭлПисьмо.Получатели.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
			        УровеньЖурналаРегистрации.Предупреждение, , ,
			        "Ни у одного из адресатов рассылки не указан e-mail!"); 
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОтчет.ИмяФайла) Тогда
			// добавить вложение
			Попытка
				ДвДанные = Новый ДвоичныеДанные(СтрокаОтчет.ИмяФайла);
				ВыбранныйФайл = Новый Файл(СтрокаОтчет.ИмяФайла);
				ФайлВложение = ЭлПисьмо.ПрикрепленныеФайлы.Добавить();
				ФайлВложение.Файл = Новый ХранилищеЗначения(ДвДанные);
				ФайлВложение.Размер = ВыбранныйФайл.Размер();
				ФайлВложение.Имя = Строка(СтрокаОтчет.ДЦ) + "_ОтчетПоНеоплаченнымЗН_" + Формат(ТекущаяДата, "ДЛФ=Д") + ВыбранныйФайл.Расширение;
				ЭлПисьмо.ЕстьВложения = Истина;
			Исключение
				ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при обработке файла-отчета: " + ОписаниеОшибки()); 
				Возврат;
			КонецПопытки;		
			// Удаление использованного файла-отчета
			Попытка
			    УдалитьФайлы(СтрокаОтчет.ИмяФайла);  
			Исключение
				ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при удалении файла-отчета: " + ОписаниеОшибки()); 
			КонецПопытки;
			ЭлПисьмо.ТекстПисьма= "Во вложении - отчёт по Неоплаченным ЗН для ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """.";
		Иначе
			ЭлПисьмо.ТекстПисьма= "По ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """ нарушений оплат ЗН нет.";
		КонецЕсли;
		
		ЭлПисьмо.Тема = "ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """: отчет по Неоплаченным ЗН от " + Формат(ТекущаяДата, "ДЛФ=ДД");
		ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
		ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
		ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
		ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;
		
		СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	    СтрокаСоединения = СтрЗаменить(СтрокаСоединения, ";", Символы.ПС);
		Если Найти(ВРег(СтрокаСоединения), "FILE=") = 1  Тогда
			// файловая
	        ИмяИБ = СтрПолучитьСтроку(СтрокаСоединения, 1);
	    Иначе
			// клиент-сервер
	        ИмяИБ = СтрПолучитьСтроку(СтрокаСоединения, 2);
		КонецЕсли;	
	    Если НЕ Пустаястрока(ИмяИБ) Тогда
			ИмяИБ = Сред(ИмяИБ, Найти(ИмяИБ, """") + 1);
		КонецЕсли;		
		ЭлПисьмо.ОтправительПредставление = "Альфа-Авто" + " (" + Лев(ИмяИБ, СтрДлина(ИмяИБ) - 1) + ") <1c@sokolmotors.ru>";
		
		ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
		ЭлПисьмо.Важность = Перечисления.Важность.Средняя;
		ЭлПисьмо.ДатаОтправления = ТекущаяДата;
		ЭлПисьмо.Дата = ТекущаяДата;
		ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
		ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
		ЭлПисьмо.Записать();
		
		СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
		СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
		Если СоединениеСПочтовымСервером <> Неопределено Тогда
			Если эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
				эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			Иначе
				эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			КонецЕсли;	
		КонецЕсли;
    КонецЦикла;

КонецПроцедуры

Функция ОпределитьВремяПеремещенияГрафик(ДЦ_уход,ДЦ_приход)
	
	ВремяНаПеремещение = 0;
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяНаПеремещениеМеждуДЦ.ДилерскийЦентрУход КАК ДилерскийЦентрУход,
		|	ВремяНаПеремещениеМеждуДЦ.ДилерскийЦентрПриход КАК ДилерскийЦентрПриход,
		|	ВремяНаПеремещениеМеждуДЦ.Продолжительность КАК Продолжительность
		|ИЗ
		|	РегистрСведений.ВремяНаПеремещениеМеждуДЦ КАК ВремяНаПеремещениеМеждуДЦ
		|ГДЕ
		|	ВремяНаПеремещениеМеждуДЦ.ДилерскийЦентрУход = &ДилерскийЦентрУход
		|	И ВремяНаПеремещениеМеждуДЦ.ДилерскийЦентрПриход = &ДилерскийЦентрПриход";
	
	Запрос.УстановитьПараметр("ДилерскийЦентрУход", ДЦ_уход);
	Запрос.УстановитьПараметр("ДилерскийЦентрПриход", ДЦ_приход);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВремяНаПеремещение =  ВыборкаДетальныеЗаписи.Продолжительность/60;
	КонецЦикла;
	
	Возврат ВремяНаПеремещение;
 
КонецФункции // ОпределитьВремяПеремещенияГрафик()

Функция ЧислоВЧасыМинуты(ЧислоВчасах)
	
    Стр = "";		
	
	Час = Цел(ЧислоВчасах);
	Мин = (ЧислоВчасах-Час)*60;
	
	Если Час > 0 Тогда
		Если Мин > 0 Тогда
			Стр = СокрЛП(Час)+" час. "+СокрЛП(Мин)+" мин.";	
		Иначе	
 			Стр = СокрЛП(Час)+" час.";	
		КонецЕсли;
	Иначе	
		Если Мин > 0 Тогда
			Стр = СокрЛП(Мин)+" мин.";	
		Иначе	
			Стр = " --- ";	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Стр;
	

КонецФункции // ЧислоВЧасыМинуты(ЧислоВчасах)
